In [1]:
import mysql.connector
import pandas as pd
from configparser import ConfigParser
from DATA225utils import make_connection, dataframe_query

In [2]:
conn = make_connection(config_file='ZAGI.ini')

Exception: Connection failed: 1049 (42000): Unknown database 'zagi_sales'

In [3]:
cursor = conn.cursor()

### 1. Display the vendor ID and vendor name for all vendors.

In [4]:
sql = """SELECT vendor_id, vendor_name FROM vendor"""

_, df = dataframe_query(conn, sql)
display(df)

  vendor_id    vendor_name
0        MK  Mountain King
1        PG  Pacifica Gear

### 2. Display the customer name and customer ZIP for all customers.

In [5]:
sql = """SELECT customer_name, customer_zip FROM customer"""

_,df = dataframe_query(conn, sql)
display(df)

  customer_name customer_zip
0          Tina        60137
1          Tony        60611
2          Pam         35401

### 3. Display the product ID, product name, and product price for products with a product price of $100 or higher.

In [6]:
sql = """SELECT product_id, product_name, product_price 
            FROM product 
            WHERE product_price >= 100"""

_,df = dataframe_query(conn, sql)
display(df)

  product_id product_name product_price
0        1X1      Zzz Bag        100.00
1        5X5    Tiny Tent        150.00
2        6X6   Biggy Tent        250.00

### 4. Display the product ID, product name, product price, and vendor name for all products. Sort the results by product ID.

In [7]:
sql = """
        SELECT p.product_id, p.product_name, p.product_price, v.vendor_name
            FROM product as p, vendor as v
            WHERE p.vendor_id = v.vendor_id
            ORDER BY p.product_id ASC
      """

_,df = dataframe_query(conn, sql)
display(df)

  product_id product_name product_price    vendor_name
0        1X1      Zzz Bag        100.00  Pacifica Gear
1        2X2    Easy Boot         70.00  Mountain King
2        3X3    Cosy Sock         15.00  Mountain King
3        4X4    Dura Boot         90.00  Pacifica Gear
4        5X5    Tiny Tent        150.00  Mountain King
5        6X6   Biggy Tent        250.00  Mountain King

### 5. Display the product ID, product name, product price, vendor name, and category name for all products. Sort the results by product ID.

In [8]:
sql = """
        SELECT p.product_id, p.product_name, p.product_price, v.vendor_name, c.category_name
            FROM product as p, vendor as v, category as c
            WHERE p.vendor_id = v.vendor_id AND p.category_id = c.category_id
            ORDER BY p.product_id ASC
      """

_,df = dataframe_query(conn, sql)
display(df)

  product_id product_name product_price    vendor_name category_name
0        1X1      Zzz Bag        100.00  Pacifica Gear       Camping
1        2X2    Easy Boot         70.00  Mountain King      Footwear
2        3X3    Cosy Sock         15.00  Mountain King      Footwear
3        4X4    Dura Boot         90.00  Pacifica Gear      Footwear
4        5X5    Tiny Tent        150.00  Mountain King       Camping
5        6X6   Biggy Tent        250.00  Mountain King       Camping

### 6. Display the product ID, product name, and product price for products in the category whose category name value is Camping. Sort the results by product ID.

In [9]:
sql = """
        SELECT p.product_id as "product ID", p.product_name as "product name", p.product_price as "product price"
            FROM product as p, category as c
            WHERE p.category_id = c.category_id AND c.category_name = 'Camping'
            ORDER BY p.product_id ASC
     """

_,df = dataframe_query(conn, sql)
display(df)

  product ID product name product price
0        1X1      Zzz Bag        100.00
1        5X5    Tiny Tent        150.00
2        6X6   Biggy Tent        250.00

### 7. Display the transaction ID, customer name, and transaction date for sales transactions involving a customer buying a product whose product name is Dura Boot.

In [10]:
sql = """
        SELECT s.tid as "transaction ID", c.customer_name as "customer name", s.tdate as "transaction date"
            FROM sales_transaction as s, customer as c, sold_via as sv, product as p
            WHERE s.customer_id = c.customer_id AND s.tid = sv.tid AND sv.product_id = p.product_id AND p.product_name = "Dura Boot"
            ORDER BY p.product_ID
     """

_,df = dataframe_query(conn, sql)
display(df)

  transaction ID customer name transaction date
0           T444          Pam        2023-02-02
1           T555          Tony       2023-02-02